<a href="https://colab.research.google.com/github/Ianoow/calculator-/blob/main/Database_assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Q2:** Create a database called `hotel`

In [ ]:
CREATE DATABASE Hotel;

Create a table `room` with columns`(room_id, room_name, room_floorno)` and another table `employees` with columns `(employee_id, employee_names, employee_address, employee_dob)`

In [ ]:
CREATE TABLE room (
    room_id int ,
    room_name VarChar(100) ,
    room_floorno int
);


CREATE TABLE employees (
    employee_id int,
    employee_names VARCHAR(150),
    employee_address VARCHAR(255),
    employee_dob DATE
);

Insert two records into each of the tables.

In [ ]:
INSERT INTO room (room_id, room_name, room_floorno)
VALUES(101, 'Conference Room', 2),(103, 'Manager Office', 3);


INSERT INTO employees (employee_id, employee_names, employee_address, employee_dob)
VALUES(101, 'Ian', '123  Nairobi', '1999-05-12'),(102, 'pithon', '456 Westlands ', '1986-09-30')

Q6 Write a query to select all countries that are in continent Africa

In [ ]:
SELECT *FROM country
WHERE
    continent = 'Africa';

Q7 Write a query to select all cities with a `population` greater than 1,000,000 and are in `CountryCode` AFG

In [ ]:
SELECT *FROM city
WHERE
    countrycode = 'AFG'
    AND population > 1000000;

Q8 From the countrylanguage table, write a query to select all countries where `isOfficial` is True (T).

In [ ]:
SELECT*FROM countrylanguage
WHERE
    isofficial = 'T'

Q9 Using the country table, select all `countries` in Europe with a `LifeExpectancy` less than 40 years. LIMIT the records to 15 records only.

In [ ]:
SELECT *FROM country
WHERE continent = 'Europe'
  AND LifeExpectancy < 40
LIMIT 15;

 Q10 SELECT columns `Code`, `Continent`, `SurfaceArea`, `IndepYear` and `GNP` FROM the country table. Filter the records to only countries in North America and have a `surfaceArea` greater than 600000.

In [ ]:
SELECT Code, Continent, SurfaceArea, IndepYear, GNP
FROM country
WHERE Continent = 'North America'
  AND SurfaceArea > 600000;